zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_jh/pic32cm_jh00/atdf/PIC32CM6408JH00064.atdf
        <register name="BTCNT" offset="0x2" rw="RW" size="2" caption="Block Transfer Count">
          <bitfield name="BTCNT" caption="Block Transfer Count" mask="0xFFFF"/>
        </register>
        <register name="SRCADDR" offset="0x4" rw="RW" size="4" caption="Block Transfer Source Address">
          <bitfield name="SRCADDR" caption="Transfer Source Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DSTADDR" offset="0x8" rw="RW" size="4" caption="Block Transfer Destination Address">
          <bitfield name="DSTADDR" caption="Transfer Destination Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DESCADDR" offset="0xC" rw="RW" size="4" caption="Next Descriptor Address">
          <bitfield name="DESCADDR" caption="Next Descriptor Address" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="DMAC_PRICTRL0__RRLVLEN0">
        <value name="STATIC_LVL" caption="Static arbitration scheme for channels with level 3 priority" value="0x0"/>
        <value name="ROUND_ROBIN_LVL" caption="Round-robin arbitration scheme for channels with level 3 priority" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__BLOCKACT">
        <value name="NOACT" caption="Channel will be disabled if it is the last block transfer in the transaction" value="0x0"/>
        <value name="INT" caption="Channel will be disabled if it is the last block transfer in the transaction and block interrupt" value="0x1"/>
        <value name="SUSPEND" caption="Channel suspend operation is completed" value="0x2"/>
        <value name="BOTH" caption="Both channel suspend operation and block interrupt" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__EVOSEL">
        <value name="DISABLE" caption="Event generation disabled" value="0x0"/>
        <value name="BLOCK" caption="Event strobe when block transfer complete" value="0x1"/>
        <value name="BEAT" caption="Event strobe when beat transfer complete" value="0x3"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSEL">
        <value name="DST" caption="Step size settings apply to the destination address" value="0x0"/>
        <value name="SRC" caption="Step size settings apply to the source address" value="0x1"/>
      </value-group>
      <value-group name="DMAC_BTCTRL__STEPSIZE">
        <value name="X1" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 1" value="0x0"/>
        <value name="X2" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 2" value="0x1"/>
        <value name="X4" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 4" value="0x2"/>
        <value name="X8" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 8" value="0x3"/>
        <value name="X16" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 16" value="0x4"/>
        <value name="X32" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 32" value="0x5"/>
        <value name="X64" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 64" value="0x6"/>
        <value name="X128" caption="Next ADDR = ADDR + (1&lt;&lt;BEATSIZE) * 128" value="0x7"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCBEATSIZE">
        <value name="BYTE" caption="8-bit bus transfer" value="0x0"/>
        <value name="HWORD" caption="16-bit bus transfer" value="0x1"/>
        <value name="WORD" caption="32-bit bus transfer" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCPOLY">
        <value name="CRC16" caption="CRC-16 (CRC-CCITT)" value="0x0"/>
        <value name="CRC32" caption="CRC32 (IEEE 802.3)" value="0x1"/>
      </value-group>
      <value-group name="DMAC_CRCCTRL__CRCSRC">
        <value name="NOACT" caption="No action" value="0x00"/>
        <value name="IO" caption="I/O interface" value="0x01"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__DQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__FQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_QOSCTRL__WRBQOS">
        <value name="DISABLE" caption="Background (no sensitive operation)" value="0x0"/>
        <value name="LOW" caption="Sensitive Bandwidth" value="0x1"/>
        <value name="MEDIUM" caption="Sensitive Latency" value="0x2"/>
        <value name="HIGH" caption="Critical Latency" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__CMD">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x1"/>
        <value name="RESUME" caption="Channel resume operation" value="0x2"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__EVACT">
        <value name="NOACT" caption="No action" value="0x0"/>
        <value name="TRIG" caption="Transfer and periodic transfer trigger" value="0x1"/>
        <value name="CTRIG" caption="Conditional transfer trigger" value="0x2"/>
        <value name="CBLOCK" caption="Conditional block transfer" value="0x3"/>
        <value name="SUSPEND" caption="Channel suspend operation" value="0x4"/>
        <value name="RESUME" caption="Channel resume operation" value="0x5"/>
        <value name="SSKIP" caption="Skip next block suspend action" value="0x6"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__LVL">
        <value name="LVL0" caption="Channel Priority Level 0" value="0x0"/>
        <value name="LVL1" caption="Channel Priority Level 1" value="0x1"/>
        <value name="LVL2" caption="Channel Priority Level 2" value="0x2"/>
        <value name="LVL3" caption="Channel Priority Level 3" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGACT">
        <value name="BLOCK" caption="One trigger required for each block transfer" value="0x0"/>
        <value name="BEAT" caption="One trigger required for each beat transfer" value="0x2"/>
        <value name="TRANSACTION" caption="One trigger required for each transaction" value="0x3"/>
      </value-group>
      <value-group name="DMAC_CHCTRLB__TRIGSRC">
        <value name="DISABLE" caption="Only software/event triggers" value="0x00"/>
        <value name="SERCOM0_RX" caption="SERCOM0 RX Trigger" value="0x02"/>
        <value name="SERCOM0_TX" caption="SERCOM0 TX Trigger" value="0x03"/>
        <value name="SERCOM1_RX" caption="SERCOM1 RX Trigger" value="0x04"/>
        <value name="SERCOM1_TX" caption="SERCOM1 TX Trigger" value="0x05"/>
        <value name="SERCOM2_RX" caption="SERCOM2 RX Trigger" value="0x06"/>
        <value name="SERCOM2_TX" caption="SERCOM2 TX Trigger" value="0x07"/>
        <value name="SERCOM3_RX" caption="SERCOM3 RX Trigger" value="0x08"/>
        <value name="SERCOM3_TX" caption="SERCOM3 TX Trigger" value="0x09"/>
        <value name="TCC0_OVF" caption="TCC0 Overflow Trigger" value="0x10"/>
        <value name="TCC0_MC0" caption="TCC0 Match/Compare 0 Trigger" value="0x11"/>
        <value name="TCC0_MC1" caption="TCC0 Match/Compare 1 Trigger" value="0x12"/>
        <value name="TCC0_MC2" caption="TCC0 Match/Compare 2 Trigger" value="0x13"/>
        <value name="TCC0_MC3" caption="TCC0 Match/Compare 3 Trigger" value="0x14"/>
        <value name="TCC1_OVF" caption="TCC1 Overflow Trigger" value="0x15"/>
        <value name="TCC1_MC0" caption="TCC1 Match/Compare 0 Trigger" value="0x16"/>
        <value name="TCC1_MC1" caption="TCC1 Match/Compare 1 Trigger" value="0x17"/>
        <value name="TCC2_OVF" caption="TCC2 Overflow Trigger" value="0x18"/>
        <value name="TCC2_MC0" caption="TCC2 Match/Compare 0 Trigger" value="0x19"/>
        <value name="TCC2_MC1" caption="TCC2 Match/Compare 1 Trigger" value="0x1A"/>
        <value name="TC0_OVF" caption="TC0 Overflow Trigger" value="0x1B"/>
        <value name="TC0_MC0" caption="TC0 Match/Compare 0 Trigger" value="0x1C"/>
        <value name="TC0_MC1" caption="TC0 Match/Compare 1 Trigger" value="0x1D"/>
        <value name="TC1_OVF" caption="TC1 Overflow Trigger" value="0x1E"/>
        <value name="TC1_MC0" caption="TC1 Match/Compare 0 Trigger" value="0x1F"/>
        <value name="TC1_MC1" caption="TC1 Match/Compare 1 Trigger" value="0x20"/>
        <value name="TC2_OVF" caption="TC2 Overflow Trigger" value="0x21"/>
        <value name="TC2_MC0" caption="TC2 Match/Compare 0 Trigger" value="0x22"/>
        <value name="TC2_MC1" caption="TC2 Match/Compare 1 Trigger" value="0x23"/>
        <value name="TC3_OVF" caption="TC3 Overflow Trigger" value="0x24"/>
        <value name="TC3_MC0" caption="TC3 Match/Compare 0 Trigger" value="0x25"/>
        <value name="TC3_MC1" caption="TC3 Match/Compare 1 Trigger" value="0x26"/>
        <value name="TC4_OVF" caption="TC4 Overflow Trigger" value="0x27"/>
        <value name="TC4_MC0" caption="TC4 Match/Compare 0 Trigger" value="0x28"/>
        <value name="TC4_MC1" caption="TC4 Match/Compare 1 Trigger" value="0x29"/>
        <value name="ADC0_RESRDY" caption="ADC0 Result Ready Trigger" value="0x2A"/>
        <value name="PTC_EOC" caption="PTC End of Conversion Trigger" value="0x2E"/>
        <value name="PTC_WCOMP" caption="PTC Window Compare Trigger" value="0x2F"/>
        <value name="PTC_SEQ" caption="PTC Sequence Trigger" value="0x30"/>
      </value-group>
    </module>
    <module name="DSU" id="U2209" version="2.5.0" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CRC" caption="32-bit Cyclic Redundancy Code" mask="0x4"/>
          <bitfield name="MBIST" caption="Memory built-in self-test" mask="0x8"/>
          <bitfield name="CE" caption="Chip-Erase" mask="0x10"/>
          <bitfield name="ARR" caption="Auxiliary Row Read" mask="0x40"/>
          <bitfield name="SMSA" caption="Start Memory Stream Access" mask="0x80"/>
        </register>
        <register name="STATUSA" offset="0x1" rw="RW" size="1" initval="0x00" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="CRSTEXT" caption="CPU Reset Phase Extension" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x10"/>
        </register>
        <register name="STATUSB" offset="0x2" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="PROT" caption="Protected" mask="0x1"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x10"/>
        </register>
